---
kind: property
id: P:Autodesk.Revit.DB.FootPrintRoof.DefinesSlope(Autodesk.Revit.DB.ModelCurve)
source: html/0ef1e959-f2fb-f466-f611-4f16b1812fd2.htm
---
# Autodesk.Revit.DB.FootPrintRoof.DefinesSlope Property

Retrieve or set the DefinesSlope of the curve.

## Syntax (C#)
```csharp
public bool this[
	ModelCurve pCurve
] { get; set; }
```

## Parameters
- **pCurve** (`Autodesk.Revit.DB.ModelCurve`)